src/ChartsOfCharacteristicTypes/ВидыАналитик/ВидыАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыАналитик</name>
  <type>
    <types>CatalogRef.Пользователи</types>
    <types>Boolean</types>
    <types>CatalogRef.Контакты</types>
    <types>CatalogRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
    <types>CatalogRef.КошелькиИСчета</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.Долги</types>
    <types>Number</types>
    <types>CatalogRef.СтатьиДоходов</types>
    <types>CatalogRef.ФинансовыеЦели</types>
    <types>CatalogRef.Имущество</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>4</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>Важность</name>
      <description>Важность</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>НаправлениеИспользования</name>
      <description>Где будет использоваться</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>ГеографияСделки</name>
      <description>География сделки</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <type>
        <types>CatalogRef.Имущество</types>
      </type>
    </items>
    <items>
      <name>КарточкаСкидок</name>
      <description>Карточка скидок</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Кредит</name>
      <description>Кредит</description>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </items>
    <items>
      <name>МестоПолученияДохода</name>
      <description>Место получения дохода</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
    <items>
      <name>МестоТраты</name>
      <description>Место траты (магазин, кафе)</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
    <items>
      <name>Пометка</name>
      <description>Пометка</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>Проект</name>
      <description>Проект</description>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
      </type>
    </items>
    <items>
      <name>ФинансоваяЦель</name>
      <description>Финансовая цель</description>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </items>
    <items>
      <name>ЧленыСемьи</name>
      <description>Члены семьи (назначение затрат, источники доходов)</description>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>АктуальнаДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьВШапкеДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитикиДохода</name>
    <comment>Значение по умолчанию в доходах</comment>
    <type>
      <types>Characteristic.ВидыАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеНастройкиДляДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальнаДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьВШапкеДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитикиРасхода</name>
    <comment>Значение по умолчанию в расходах</comment>
    <type>
      <types>Characteristic.ВидыАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеНастройкиДляРасхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоУмолчанию</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/InformationRegisters/НастройкиАналитикиПоСтатьям/НастройкиАналитикиПоСтатьям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиАналитикиПоСтатьям</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Characteristic.ВидыАналитик</types>
    </type>
  </resources>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАналитики</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыАналитик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СтатьиРасходов/СтатьиРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиРасходов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ИзменениеОстатка</name>
      <description>Изменение остатка</description>
    </items>
    <items>
      <name>ОбменВалюты</name>
      <description>Обмен валюты</description>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличественныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПропускатьВводКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомментарийПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СтатьиДоходов/СтатьиДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДоходов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОбменВалюты</name>
      <description>Обмен валюты</description>
    </items>
    <items>
      <name>ПрочиеДоходы</name>
      <description>Прочие доходы</description>
    </items>
    <items>
      <name>ИзменениеОстатка</name>
      <description>Изменение остатка</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПропускатьВводКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомментарийПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfCharacteristicTypes/ВидыАналитик/Forms/НастройкиВидимостиПоСтатьям/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Параметры формы
//	ВидАналитики - Элемент вида аналитики, для которого выполняются настройки
//  ЭтоРасход    - Булево - если Истина, настройки выполняются для статей расходов, иначе - для статей доходов
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка условного оформления для форм списков:
	РаботаСФормамиСправочников.УстановитьУсловноеОформлениеФормыСписка(ЭтотОбъект, "ДеревоНастроек", Истина, , ,Ложь);
	
	ВидАналитики = Параметры.ВидАналитики;
	ЭтоРасход = Параметры.ЭтоРасход;
	
	Если ЗначениеЗаполнено(ВидАналитики) Тогда
		//ЗаблокироватьДанныеДляРедактирования(ВидАналитики,, УникальныйИдентификатор);
	Иначе
		ВызватьИсключение НСтр("ru = 'Пустые параметры формы.'");
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Видимость аналитики по статьям '") + ?(ЭтоРасход, НСтр("ru = 'расходов'"), НСтр("ru = 'доходов'"));
	
	Элементы.ДеревоНастроекИзменить.ТолькоВоВсехДействиях = Истина;
	Элементы.ДеревоНастроекГруппаНастройкиЗаполненияВОперациях.Заголовок = НСтр("ru = 'Видимость аналитики по статьям '") + ?(ЭтоРасход, НСтр("ru = 'расходов'"), НСтр("ru = 'доходов'"));
	
	ПрочитатьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидАналитикиПриИзменении(Элемент)
	
	ПрочитатьНастройкиНаСервере();
	
	Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАналитикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Модифицированность И ЗначениеЗаполнено(ВидАналитики) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ВидАналитикиНачалоВыбораЗавершение", ЭтотОбъект, ДанныеВыбора);
		ТекстВопроса = НСтр("ru = 'Сделанные изменения будут потеряны.
			           			  |Продолжить?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , Заголовок);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАналитикиОчистка(Элемент, СтандартнаяОбработка)
	
	Если Модифицированность И ЗначениеЗаполнено(ВидАналитики) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ВидАналитикиОчисткаЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Сделанные изменения будут потеряны.
			           			  |Продолжить?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , Заголовок);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьВШапкеПриИзменении(Элемент)
	
	ЗаблокироватьДанные();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоНастроек

&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДеревоНастроекСтатья И ВыбраннаяСтрока <> ИдентификаторКорневойСтрокиДереваНастроек Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЭтоРасход Тогда
			ОткрытьФорму("Справочник.СтатьиРасходов.ФормаОбъекта", Новый Структура("Ключ", Элементы.ДеревоНастроек.ТекущиеДанные.Статья), ЭтаФорма);
		Иначе
			ОткрытьФорму("Справочник.СтатьиДоходов.ФормаОбъекта", Новый Структура("Ключ", Элементы.ДеревоНастроек.ТекущиеДанные.Статья), ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииЯчейки(Элемент)
	
	ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	ТекущаяКолонка = Элементы.ДеревоНастроек.ТекущийЭлемент;
	
	ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи = ?(ТекущиеДанные = Неопределено, Ложь, 
		ТекущиеДанные.ЭтоУзел ИЛИ Элементы.ДеревоНастроек.ВыделенныеСтроки.Количество() > 1);
	
	ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи = ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи
		И (ТекущаяКолонка = Элементы.ДеревоНастроекИспользовать 
			ИЛИ ТекущаяКолонка = Элементы.ДеревоНастроекЗначениеПоУмолчанию);
			
	Если Элементы.ДеревоНастроекСкопироватьНастройкиНаПодстатьи.Доступность <> ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи Тогда
		Элементы.ДеревоНастроекСкопироватьНастройкиНаПодстатьи.Доступность = ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи;
		Элементы.ДеревоНастроекКонтекстноеМенюСкопироватьНастройкиНаПодстатьи.Доступность = ДоступностьКнопкиСкопироватьНастройкиНаПодстатьи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	ЗаблокироватьДанные();
	Отказ = НЕ ДанныеЗаблокированы;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекИспользоватьПриИзменении(Элемент)
	
	ВыделенныеСтроки = Элементы.ДеревоНастроек.ВыделенныеСтроки;
	
	ПрименятьДляПодчиненных = Ложь;
	//Если ВыделенныеСтроки.Количество() > 1 Тогда
	//	Если Вопрос(НСтр("ru = 'Применить для выделенных и подчиненных им статей?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
	//		Возврат;
	//	КонецЕсли;
	//	ПрименятьДляПодчиненных = Истина;
	//Иначе
	//	ПрименятьДляПодчиненных = ВопросПрименитьДляПодчиненных();
	//КонецЕсли;
	
	СтрокаИсточник = Элементы.ДеревоНастроек.ТекущиеДанные;
	Для каждого ИДСтрокиДерева Из ВыделенныеСтроки Цикл
		СтрокаПриемник = ДеревоНастроек.НайтиПоИдентификатору(ИДСтрокиДерева);
		СкопироватьНастройкиНаПодчиненнуюСтроку(СтрокаИсточник, СтрокаПриемник, "Использовать", ПрименятьДляПодчиненных);
	КонецЦикла;
	
	Если Элементы.ДеревоНастроек.ТекущаяСтрока <> ИдентификаторКорневойСтрокиДереваНастроек Тогда
		КорневаяСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторКорневойСтрокиДереваНастроек);
		КорневаяСтрока.Использовать = АналитикаИспользуетсяДляВсехСтатей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекЗначениеПоУмолчаниюПриИзменении(Элемент)
	
	КорневаяСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторКорневойСтрокиДереваНастроек);
	Если Элементы.ДеревоНастроек.ТекущаяСтрока = ИдентификаторКорневойСтрокиДереваНастроек Тогда
		ОсновноеЗначение = КорневаяСтрока.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ДеревоНастроек.ВыделенныеСтроки;
	
	ПрименятьДляПодчиненных = Ложь;
	//Если ВыделенныеСтроки.Количество() > 1 Тогда
	//	Если Вопрос(НСтр("ru = 'Применить для выделенных и подчиненных им статей?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
	//		Возврат;
	//	КонецЕсли;
	//	ПрименятьДляПодчиненных = Истина;
	//Иначе
	//	ПрименятьДляПодчиненных = ВопросПрименитьДляПодчиненных();
	//КонецЕсли;
	
	СтрокаИсточник = Элементы.ДеревоНастроек.ТекущиеДанные;
	Для каждого ИДСтрокиДерева Из ВыделенныеСтроки Цикл
		СтрокаПриемник = ДеревоНастроек.НайтиПоИдентификатору(ИДСтрокиДерева);
		СкопироватьНастройкиНаПодчиненнуюСтроку(СтрокаИсточник, СтрокаПриемник, "ЗначениеПоУмолчанию", ПрименятьДляПодчиненных);
	КонецЦикла;
	
	Если Элементы.ДеревоНастроек.ТекущаяСтрока <> ИдентификаторКорневойСтрокиДереваНастроек Тогда
		КорневаяСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторКорневойСтрокиДереваНастроек);
		КорневаяСтрока.Использовать = АналитикаИспользуетсяДляВсехСтатей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройкиНаСервере();
	Оповестить("Записан вид характеристик", Новый Структура("ИмяПланаВидовХарактеристик,Ссылка,ВладелецФормы", "ВидыАналитик", ВидАналитики, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	ЗаписатьНастройкиНаСервере();
	Оповестить("Записан вид характеристик", Новый Структура("ИмяПланаВидовХарактеристик,Ссылка,ВладелецФормы", "ВидыАналитик", ВидАналитики, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	
	ПрочитатьНастройкиНаСервере();
	
	Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	
	ПрочитатьНастройкиНаСервере();
	
	Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	// Свернем построчно первый уровень
	Для каждого СтрокаДерева Из ДеревоНастроек.ПолучитьЭлементы()[0].ПолучитьЭлементы() Цикл
		Элементы.ДеревоНастроек.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНастройкиНаПодстатьи(Команда)
	
	СтрокаИсточник = Элементы.ДеревоНастроек.ТекущиеДанные;
	Если СтрокаИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтрокаИсточник.ЭтоУзел И Элементы.ДеревоНастроек.ВыделенныеСтроки.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ДеревоНастроек.ТекущийЭлемент = Элементы.ДеревоНастроекИспользовать Тогда
		ИмяТекущейКолонки = "Использовать";
		ТекстВопроса = НСтр("ru = '%1 флажок ""Показывать"" у подстатей выделенной статьи?'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, 
						?(СтрокаИсточник.Использовать, НСтр("ru = 'Установить'"), НСтр("ru = 'Снять'")));
		
	ИначеЕсли Элементы.ДеревоНастроек.ТекущийЭлемент = Элементы.ДеревоНастроекЗначениеПоУмолчанию Тогда
		ИмяТекущейКолонки = "ЗначениеПоУмолчанию";
		Если ЗначениеЗаполнено(СтрокаИсточник.ЗначениеПоУмолчанию) Тогда
			ТекстВопроса = НСтр("ru = 'Установить ""Значение по умолчанию: %1"" для подстатей выделенной статьи?'");
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СтрокаИсточник.ЗначениеПоУмолчанию);
		Иначе
			ТекстВопроса = НСтр("ru = 'Очистить колонку ""Значение по умолчанию"" для подстатей выделенной статьи?'");
		КонецЕсли;
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("СтрокаИсточник, ИмяТекущейКолонки", СтрокаИсточник, ИмяТекущейКолонки);
	ОбработчикОтвета = Новый ОписаниеОповещения("СкопироватьНастройкиНаПодстатьиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиНаСервере()
	
	Если ЗначениеЗаполнено(ВидАналитики) Тогда
		
		Если ЭтоРасход Тогда
			ОсновноеЗначение      = ВидАналитики.ЗначениеАналитикиРасхода;
			РедактироватьВШапке   = ВидАналитики.РедактироватьВШапкеДляРасхода;
		Иначе
			ОсновноеЗначение      = ВидАналитики.ЗначениеАналитикиДохода;
			РедактироватьВШапке   = ВидАналитики.РедактироватьВШапкеДляДохода;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьДеревоСтатей();
	
	Модифицированность = Ложь;
	
	РазблокироватьДанныеДляРедактирования(ВидАналитики, УникальныйИдентификатор);
	ДанныеЗаблокированы = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСтатей()

	ДеревоНастроек.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидАналитики", ВидАналитики);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статьи.Ссылка КАК Статья,
	|	Статьи.Активность КАК СтатьяАктивность,
	|	Статьи.ПометкаУдаления КАК СтатьяПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Статьи.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА Статьи.Предопределенный
	|			ТОГДА 5
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА НастройкиАналитикиПоСтатьям.ЗначениеПоУмолчанию ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использовать,
	|	НастройкиАналитикиПоСтатьям.ЗначениеПоУмолчанию
	|ИЗ
	|	Справочник.СтатьиРасходов КАК Статьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАналитикиПоСтатьям КАК НастройкиАналитикиПоСтатьям
	|		ПО (НастройкиАналитикиПоСтатьям.Статья = Статьи.Ссылка)
	|			И (НастройкиАналитикиПоСтатьям.ВидАналитики = &ВидАналитики)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Статьи.Наименование
	|ИТОГИ ПО
	|	ОБЩИЕ,
	|	Статья ИЕРАРХИЯ";
	Если НЕ ЭтоРасход Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.СтатьиРасходов", "Справочник.СтатьиДоходов");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗаполнитьУзелДереваСтатей(Выборка, ДеревоНастроек.ПолучитьЭлементы());
	
	ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторКорневойСтрокиДереваНастроек).Использовать = АналитикаИспользуетсяДляВсехСтатей();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУзелДереваСтатей(Выборка, СтрокиДерева, ВыборкаРодитель = Неопределено, СтрокаРодитель = Неопределено)
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			// Создадим и заполним корневой узел
			Строка = СтрокиДерева.Добавить();
			Строка.ЭтоУзел = Истина;
			Строка.Статья = ?(ЭтоРасход, Справочники.СтатьиРасходов.ПустаяСсылка(), Справочники.СтатьиДоходов.ПустаяСсылка());
			Строка.СтатьяАктивность = Истина;
			Строка.СтатьяПометкаУдаления = Ложь;
			Строка.ИндексКартинки = 3;
			Строка.Использовать = Истина;
			Строка.ЗначениеПоУмолчанию = ОсновноеЗначение;
			
			ИдентификаторКорневойСтрокиДереваНастроек = Строка.ПолучитьИдентификатор();
			
			ЗаполнитьУзелДереваСтатей(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Статья"), Строка.ПолучитьЭлементы(), Выборка, Строка);
			
		ИначеЕсли Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			// Создадим и частично заполним узел
			Строка = СтрокиДерева.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			Строка.ЭтоУзел = Истина;
			
			ЗаполнитьУзелДереваСтатей(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Статья"), Строка.ПолучитьЭлементы(), Выборка, Строка);
		
		ИначеЕсли Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			ДетальныеЗаписи = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
			ДетальныеЗаписи.Следующий();
			
			Если ВыборкаРодитель <> Неопределено И Выборка.Статья = ВыборкаРодитель.Статья Тогда
				// Дозаполним родительский узел
				ЗаполнитьЗначенияСвойств(СтрокаРодитель, ДетальныеЗаписи);
			Иначе
				// Создадим и заполним обычную строку
				Строка = СтрокиДерева.Добавить();
				ЗаполнитьЗначенияСвойств(Строка, ДетальныеЗаписи);
				Строка.ЭтоУзел = Ложь;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	
	Если ЗначениеЗаполнено(ВидАналитики) Тогда
		
		ЗаблокироватьДанныеДляРедактирования(ВидАналитики, ВидАналитики.ВерсияДанных, УникальныйИдентификатор);
		
		НачатьТранзакцию();
		
		// Запись данных элемента аналитики
		ВидАналитикиОбъект = ВидАналитики.ПолучитьОбъект();
		
		Если ЭтоРасход Тогда
			ВидАналитикиОбъект.ЗначениеАналитикиРасхода        = ОсновноеЗначение;
			ВидАналитикиОбъект.РедактироватьВШапкеДляРасхода   = РедактироватьВШапке;
		Иначе
			ВидАналитикиОбъект.ЗначениеАналитикиДохода         = ОсновноеЗначение;
			ВидАналитикиОбъект.РедактироватьВШапкеДляДохода    = РедактироватьВШапке;
		КонецЕсли;
		
		ВидАналитикиОбъект.Записать();
		
		// Прочитаем записи регистра
		НаборЗаписей = РегистрыСведений.НастройкиАналитикиПоСтатьям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидАналитики.Установить(ВидАналитики);
		НаборЗаписей.Прочитать();
		
		// Удалим статьи только текущего типа
		ТекущийТипСтатей = ?(ЭтоРасход, Тип("СправочникСсылка.СтатьиРасходов"), Тип("СправочникСсылка.СтатьиДоходов"));
		МассивЗаписейДляУдаления = Новый Массив;
		Для каждого Запись Из НаборЗаписей Цикл
			Если ТипЗнч(Запись.Статья) = ТекущийТипСтатей Тогда
				МассивЗаписейДляУдаления.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		Для каждого Запись Из МассивЗаписейДляУдаления Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
		// Запись в регистр
		ДобавитьЗаписиВНаборПоДеревуНастроек(НаборЗаписей, ДеревоНастроек.ПолучитьЭлементы()[0].ПолучитьЭлементы(), ВидАналитики);
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
		РазблокироватьДанныеДляРедактирования(ВидАналитики, УникальныйИдентификатор);
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаписиВНаборПоДеревуНастроек(НаборЗаписей, ДеревоНастроекДанныеФормыКоллекция, ВидАналитики)

	Для каждого СтрокаДерева Из ДеревоНастроекДанныеФормыКоллекция Цикл
		
		Если СтрокаДерева.Использовать Тогда
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаДерева, "Статья, Использовать, ЗначениеПоУмолчанию");
			Запись.ВидАналитики = ВидАналитики;
		КонецЕсли;
		
		ПодчиненнаяКоллекция = СтрокаДерева.ПолучитьЭлементы();
		Если ПодчиненнаяКоллекция.Количество() <> 0 Тогда
			ДобавитьЗаписиВНаборПоДеревуНастроек(НаборЗаписей, ПодчиненнаяКоллекция, ВидАналитики);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АналитикаИспользуетсяДляВсехСтатей()

	Возврат РеквизитФормыВЗначение("ДеревоНастроек").Строки[0].Строки.Найти(Ложь, "Использовать", Истина) = Неопределено;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СкопироватьНастройкиНаПодчиненнуюСтроку(СтрокаИсточник, СтрокаПриемник, ИмяТекущейКолонки, ЗаполнятьПодчиненныеЭлементы = Ложь)

	// Установим значение в текущей строке
	Если ИмяТекущейКолонки = "Использовать" Тогда
		СтрокаПриемник.Использовать = СтрокаИсточник.Использовать;
		
		// Если установили флаг использования, заполним непустые значения по умолчанию по родителю
		СтрокаРодитель = СтрокаПриемник.ПолучитьРодителя();
		Если СтрокаИсточник.Использовать = Истина И НЕ ЗначениеЗаполнено(СтрокаПриемник.ЗначениеПоУмолчанию) И СтрокаРодитель <> Неопределено Тогда
			СтрокаПриемник.ЗначениеПоУмолчанию = СтрокаРодитель.ЗначениеПоУмолчанию;
		КонецЕсли;
		
	ИначеЕсли ИмяТекущейКолонки = "ЗначениеПоУмолчанию" Тогда
		СтрокаПриемник.ЗначениеПоУмолчанию = СтрокаИсточник.ЗначениеПоУмолчанию;
		
		// Если заполнили значение по умолчанию, установим флаг использования
		Если ЗначениеЗаполнено(СтрокаПриемник.ЗначениеПоУмолчанию) Тогда
			СтрокаПриемник.Использовать = Истина;
		КонецЕсли;
		
	Иначе
		// Просто копируем все настройки
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, "Использовать, ЗначениеПоУмолчанию");
	
	КонецЕсли;
	
	// Установим значение в подчиненных строках
	Если ЗаполнятьПодчиненныеЭлементы Тогда
		Для каждого СтрокаДерева Из СтрокаПриемник.ПолучитьЭлементы() Цикл
			СкопироватьНастройкиНаПодчиненнуюСтроку(СтрокаИсточник, СтрокаДерева, ИмяТекущейКолонки, ЗаполнятьПодчиненныеЭлементы)
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьДанные()

	Если НЕ ДанныеЗаблокированы Тогда
		
		ОписаниеОшибки = ЗаблокироватьДанныеНаСервере();
		Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаблокироватьДанныеНаСервере()

	Попытка
		ЗаблокироватьДанныеДляРедактирования(ВидАналитики, ВидАналитики.ВерсияДанных, УникальныйИдентификатор);
		ДанныеЗаблокированы = Истина;
		Возврат "";
	Исключение
		ПрочитатьНастройкиНаСервере();
		Возврат ИнформацияОбОшибке().Причина.Описание;
	КонецПопытки;

КонецФункции

&НаКлиенте
Процедура ВидАналитикиОчисткаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ВидАналитики = Неопределено;
		Модифицированность = Истина;
		ПрочитатьНастройкиНаСервере();
		Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек);
		
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ВидАналитикиНачалоВыбораЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ВидАналитики = ДополнительныеПараметры;
		Модифицированность = Истина;
		ПрочитатьНастройкиНаСервере();
		Элементы.ДеревоНастроек.Развернуть(ИдентификаторКорневойСтрокиДереваНастроек);
		
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	ЗаписатьНастройкиНаСервере();
	Модифицированность = Ложь;
	Оповестить("Записан вид характеристик", Новый Структура("ИмяПланаВидовХарактеристик,Ссылка,ВладелецФормы", "ВидыАналитик", ВидАналитики, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	Закрыть();

КонецПроцедуры
 
&НаКлиенте
Процедура СкопироватьНастройкиНаПодстатьиЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		
		ВыделенныеСтроки = Элементы.ДеревоНастроек.ВыделенныеСтроки;
		Для каждого ИДСтрокиДерева Из ВыделенныеСтроки Цикл
			СтрокаПриемник = ДеревоНастроек.НайтиПоИдентификатору(ИДСтрокиДерева);
			СкопироватьНастройкиНаПодчиненнуюСтроку(ДополнительныеПараметры.СтрокаИсточник, СтрокаПриемник, ДополнительныеПараметры.ИмяТекущейКолонки, Истина);
		КонецЦикла;
		
		КорневаяСтрока = ДеревоНастроек.НайтиПоИдентификатору(ИдентификаторКорневойСтрокиДереваНастроек);
		КорневаяСтрока.Использовать = АналитикаИспользуетсяДляВсехСтатей();
		
	КонецЕсли;

КонецПроцедуры
 

#КонецОбласти
